tutorials/incompressible/pisoFoam/LES/motorBike/motorBike/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# copy motorbike surface from resources directory
\cp $FOAM_TUTORIALS/resources/geometry/motorBike.obj.gz constant/triSurface/

# Make dummy 0 directory
mkdir 0

runApplication blockMesh
# \cp system/decomposeParDict.hierarchical system/decomposeParDict
runApplication decomposePar -decomposeParDict system/decomposeParDict.hierarchical

# \cp system/decomposeParDict.ptscotch system/decomposeParDict
runParallel snappyHexMesh -decomposeParDict system/decomposeParDict.ptscotch -profiling -overwrite -parallel

find . -type f -iname "*level*" -exec rm {} \;

#- Set the initial fields
restore0Dir -processor

runParallel renumberMesh -overwrite
runParallel potentialFoam -initialiseUBCs
runParallel $(getApplication)

#------------------------------------------------------------------------------
